IDEA StatiCa Open Model
MatReinforcementEc2 Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material reinforcement Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatReinforcementEc2
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatReinforcementEc2 : MatReinforcement
Public Class MatReinforcementEc2
	Inherits MatReinforcement
public ref class MatReinforcementEc2 : public MatReinforcement
The MatReinforcementEc2 type exposes the following members.
Constructors
Name | Description
MatReinforcementEc2
Initializes a new instance of the MatReinforcementEc2 class
Top
Properties
Name | Description
BarSurface
 Surface of bar
 (Inherited from MatReinforcement.)
Class
 Class of reinforcement
CoeffFtkByFyk
 Coefficient ftk/fyk - k
DiagramType
 Type of material diagram
E
 Young's modulus
 (Inherited from Material.)
Epsuk
 Characteristic strain of reinforcement at maximum load - εuk
Fabrication
 Fabrication of reinforcement
Ftk
 Characteristic tensile strength of reinforcement - ftk
Fyk
 Characteristic yield strength of reinforcement - fyk
G
 Shear modulus
 (Inherited from Material.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsDefaultMaterial
 True if material is default material from the code
 (Inherited from Material.)
LoadFromLibrary
 Load from library - try override properties from library find material by name
 (Inherited from Material.)
Name
 Name of material
 (Inherited from Material.)
OrderInCode
 Order of this material in the code
 (Inherited from Material.)
Poisson
 Poisson's ratio
 (Inherited from Material.)
SpecificHeat
 Specific heat capacity
 (Inherited from Material.)
StateOfThermalConductivity
 State of thermal conductivity curvature
 (Inherited from Material.)
StateOfThermalExpansion
 State of thermal expansion curvature
 (Inherited from Material.)
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
 (Inherited from Material.)
StateOfThermalStrain
 State of thermal strain curvature
 (Inherited from Material.)
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
 (Inherited from Material.)
ThermalConductivity
 Thermal conductivity
 (Inherited from Material.)
ThermalExpansion
 Thermal expansion
 (Inherited from Material.)
Type
 Type of reinforcement
UnitMass
 Unit weight
 (Inherited from Material.)
UserDiagram
 Stress-strain diagram defined by user
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
 (Inherited from Material.)
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
 (Inherited from Material.)
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
 (Inherited from Material.)
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
 (Inherited from Material.)
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 (Inherited from Material.)
Top
Examples
 This sample shows how to create reinforcement material.
//Creating the model
OpenModel openModel = new OpenModel();
//Reinforcement material
MatReinforcementEc2 matR = new MatReinforcementEc2();
matR.Name = "Reinf";
matR.UnitMass = 7850.0;
matR.E = 200e9;
matR.Poisson = 0.2;
matR.G = 83.333e9;
matR.SpecificHeat = 0.6;
matR.ThermalExpansion = 0.00001;
matR.ThermalConductivity = 45;
matR.BarSurface = ReinfBarSurface.Ribbed;
matR.Fyk = 387e6;
matR.CoeffFtkByFyk = 1.05;
matR.Epsuk = 0.025;
matR.Class = ReinfClass.A;
matR.Type = ReinfType.Bars;
matR.Fabrication = ReinfFabrication.HotRolled;
matR.DiagramType = ReinfDiagramType.BilinerWithAnInclinedTopBranch;
//Setting thermal characteristcs of material (in this case by the code)
matR.StateOfThermalConductivity = ThermalConductivityState.Code;
matR.StateOfThermalExpansion = ThermalExpansionState.Code;
matR.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
matR.StateOfThermalStressStrain = ThermalStressStrainState.Code;
openModel.AddObject(matR);
See Also
Reference
IdeaRS.OpenModel.Material Namespace